{
    "version": "https://jsonfeed.org/version/1",
    "title": "Bill Zito",
    "home_page_url": "http://localhost:4000/",
    "feed_url": "http://localhost:4000/feed.json",
    "description": null,
    "icon": "http://localhost:4000/apple-touch-icon.png",
    "favicon": "http://localhost:4000/favicon.ico",
    "expired": false,
    
    "author": "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}",
    
"items": [
    
        {
            "id": "http://localhost:4000/2020/11/28/educated",
            "title": "Educated",
            "summary": null,
            "content_text": "Spoiler alert: going to talk about details of the bookEducated is a really good book. Tara (the author) manages to tell the story as she experienced it without passing judgement on her family for things they did wrong, giving us a clearer view of the struggle to figure out what is “true” when living for decades in others’ distorted (and sometimes abusive) realities. If you’ve read the book, I’m interested in your hot-takes, and if you haven’t, take this as a pitch to read it!My biggest takeaways:  Especially when so many things that matter (family, livelihood, safety) are tied to our beliefs about the world, it can be very hard to figure out what is true. There is part of her (and part of me) that wants to believe fake realities we’ve been told, convenient stories. This helped me think more clearly about stories family members and I had once believed.  Guilt is a very powerful weapon for abusers – abusers decrease others’ self-worth and use that to get what they want. Abusers are kind sometimes, and rationalize their abuse to make it reality, leaving the abused with an alternative reality. Abusers often have some sociopathic qualities. And then they use the fact that the abused are not sociopathic to mainpulate them into thinking they are in the wrong.  When you have to be self-reliant to survive, have tried to trust your loved ones and they’ve repeatedly failed you, it’s hard to ask for help. “I can fix this” is dangerous – sometimes we need to ask for help. Also, sometimes it’s better to decide not to abandon the problem altogether. This helped me realize ways in which I was being unnecessarily self-reliant.  So much of beliefs are based on what we’ve seen happen in similiar situations – it takes conscious effort to think about what one should say instead of the brain’s auto-fill function. It’s wild how many people never escape from the “reality” they are born into, and further wild that even those who do learn to believe other things still have trouble breaking free of cached beliefs and habits.",
            "content_html": "<p><strong>Spoiler alert: going to talk about details of the book</strong></p><p>Educated is a really good book. Tara (the author) manages to tell the story as she experienced it without passing judgement on her family for things they did wrong, giving us a clearer view of the struggle to figure out what is “true” when living for decades in others’ distorted (and sometimes abusive) realities. If you’ve read the book, I’m interested in your hot-takes, and if you haven’t, take this as a pitch to read it!</p><p>My biggest takeaways:</p><ul>  <li>Especially when so many things that matter (family, livelihood, safety) are tied to our beliefs about the world, it can be very hard to figure out what is true. There is part of her (and part of me) that wants to believe fake realities we’ve been told, convenient stories. This helped me think more clearly about stories family members and I had once believed.</li>  <li>Guilt is a very powerful weapon for abusers – abusers decrease others’ self-worth and use that to get what they want. Abusers are kind sometimes, and rationalize their abuse to make it reality, leaving the abused with an alternative reality. Abusers often have some sociopathic qualities. And then they use the fact that the abused are not sociopathic to mainpulate them into thinking they are in the wrong.</li>  <li>When you have to be self-reliant to survive, have tried to trust your loved ones and they’ve repeatedly failed you, it’s hard to ask for help. “I can fix this” is dangerous – sometimes we need to ask for help. Also, sometimes it’s better to decide not to abandon the problem altogether. This helped me realize ways in which I was being unnecessarily self-reliant.</li>  <li>So much of beliefs are based on what we’ve seen happen in similiar situations – it takes conscious effort to think about what one should say instead of the brain’s auto-fill function. It’s wild how many people never escape from the “reality” they are born into, and further wild that even those who do learn to believe other things still have trouble breaking free of cached beliefs and habits.</li></ul>",
            "url": "http://localhost:4000/2020/11/28/educated",
            
            
            
            
            
            "date_published": "2020-11-28T00:00:00-08:00",
            "date_modified": "2020-11-28T00:00:00-08:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/10/11/pretty-good-is-not-good-enough",
            "title": "Pretty Good Is Not Good Enough",
            "summary": null,
            "content_text": "Most people who care about helping others follow a strategy that seems reasonable: find a field that you care about (e.g. criminal justice reform, education, public health, voting), try to find promising interventions in that field, and pursue those. I did this for many years. If interventions had similar orders of magnitude of impact, this would be a reasonable strategy. Unfortunately, I’m confident they do not.The world’s biggest problems by 80,000 hours lays out an introduction to this argument pretty well, but I’m going to take one of the charts they cite and then focus on taking the conclusion of top interventions mattering a lot more than pretty good interventions seriously.“Cost-effectiveness of health interventions as found in the Disease Controls Priorities Project 2. See “The moral imperative towards cost-effectiveness in global health” by Toby Ord for more explanation.”I haven’t fact-checked the book that Toby Ord cites (which 80k then cites, which I then cite, which isn’t a good algorithm for a rigorous graph), but he seems like a pretty good researcher from his other work, and this is just a useful graph to get across something I have other evidence for.The median intervention on this graph is 5 DALYs/$1000 – “DALY is a “disability adjusted life year” i.e. a year of life lost to ill health – the opposite of a “quality adjusted life year””. Eye-balling the 75th percentile, it’s at about 50 DALYs/$1000. The top intervention is at 300 DALYs/$1000, 6x the 75th percentile and 60x the median. Note that this top intervention seems a little too good to be true to me (AMF, one of GiveWell’s top charities, thinks it’s closer to 30 DALYs/$1000, so I think the 75th percentile is closer to the real max, at least for things that have the ability to accept large donations). As Toby notes if you click the link, DALY is a rough metric which has some error, but when interventions have &gt;100x difference in impact, that error is small compared to the difference in impact.People above the 50th percentile look at everyone else in their field and say “Look! We’re making real change, and we’re better than so many people, not to mention the people that don’t even get added to a graph like this!” But they’re still 10x worse than the 75th percentile.If you have 10 friends working in global health, and they’re all smart and thoughtful about how to have impact, they’re probably somewhere between the 25th percentile and the top. Let’s just assume they’re randomly distributed between the 25th percentile and the 100th percentile. Even though all 10 of those friends are working on useful things, and even though all 10 of them think they’ve thought through how to have the most impact, the top one of those friends is likely making  &gt;10x as much impact as the least impactful.That’s super counterintuitive to me at least. People naturally sort others they meet into “good” and “not so good,” but this means we need a higher bar.There are important follow-up questions:      Does intervention X (e.g. criminal justice, education) look like this? How do interventions in criminal justice compare to health? I don’t know enough to make super strong claims about what the distributions look like, but I do feel confident that most interventions have about 0 impact, and that there are at least a couple orders of magnitude difference between high-impact and low-impact interventions in a given field.        How much error is there when we estimate the impact of a new intervention we don’t know about? A lot, and it’s important to experiment with new things that could be in the top category. I think the EA community does a good job of funding experimental projects. But it’s also important not to waste our time with things that look a lot like things with little to no impact, which unfortunately I think is &gt;50% (and probably &gt;90%) of U.S. nonprofit funding.        Am I advocating we only work on a few top interventions? No. It’s important to spread out our resources somewhat, and oftentimes people will have developed specialized skills or other personal fit that make them better at working on specific things. But I think it’s still pretty clear that we can divert a lot of the 50-90+% of funding that we’re wasting onto things that we think might actually help pepole. On the margin, I want to move people towards more impactful work– I’m not arguing for some globally optimum algorithm for telling everyone exactly the 3 projects they should work on.        If you’ve gotten this far, common misconceptions about effective altruism may also be of interest.  I think a lot of highly capable people think they’re spending enough time figuring out the highest impact interventions when they’re not. The difference between being “one of the better interventions” and “being in the top few percent of interventions” seems likely to be &gt;10x.",
            "content_html": "<p>Most people who care about helping others follow a strategy that seems reasonable: find a field that you care about (e.g. criminal justice reform, education, public health, voting), try to find promising interventions in that field, and pursue those. I did this for many years. If interventions had similar orders of magnitude of impact, this would be a reasonable strategy. Unfortunately, I’m confident they do not.</p><p><a href=\"https://80000hours.org/career-guide/world-problems/\">The world’s biggest problems</a> by 80,000 hours lays out an introduction to this argument pretty well, but I’m going to take one of the charts they cite and then focus on taking the conclusion of top interventions mattering a lot more than pretty good interventions seriously.</p><p><img src=\"https://github.com/BillZito/billzito.github.io/blob/master/assets/cost-effectiveness.png?raw=true\" alt=\"cost-effectiveness\" /></p><p>“Cost-effectiveness of health interventions as found in the Disease Controls Priorities Project 2. See <a href=\"https://www.cgdev.org/sites/default/files/1427016_file_moral_imperative_cost_effectiveness.pdf\">“The moral imperative towards cost-effectiveness in global health”</a> by Toby Ord for more explanation.”</p><p>I haven’t fact-checked the book that Toby Ord cites (which 80k then cites, which I then cite, which isn’t a good algorithm for a rigorous graph), but he seems like a pretty good researcher from his other work, and this is just a useful graph to get across something I have other evidence for.</p><p>The median intervention on this graph is 5 DALYs/$1000 – “DALY is a “disability adjusted life year” i.e. a year of life lost to ill health – the opposite of a “quality adjusted life year””. Eye-balling the 75th percentile, it’s at about 50 DALYs/$1000. The top intervention is at 300 DALYs/$1000, 6x the 75th percentile and 60x the median. Note that this top intervention seems a little too good to be true to me (AMF, one of GiveWell’s top charities, thinks it’s closer to 30 DALYs/$1000, so I think the 75th percentile is closer to the real max, at least for things that have the ability to accept large donations). As Toby notes if you click the link, DALY is a rough metric which has some error, but when interventions have &gt;100x difference in impact, that error is small compared to the difference in impact.</p><p>People above the 50th percentile look at everyone else in their field and say “Look! We’re making real change, and we’re better than so many people, not to mention the people that don’t even get added to a graph like this!” But they’re still 10x worse than the 75th percentile.</p><p>If you have 10 friends working in global health, and they’re all smart and thoughtful about how to have impact, they’re probably somewhere between the 25th percentile and the top. Let’s just assume they’re randomly distributed between the 25th percentile and the 100th percentile. Even though all 10 of those friends are working on useful things, and even though all 10 of them think they’ve thought through how to have the most impact, the top one of those friends is likely making  &gt;10x as much impact as the least impactful.</p><p>That’s super counterintuitive to me at least. People naturally sort others they meet into “good” and “not so good,” but this means we need a higher bar.</p><p>There are important follow-up questions:</p><ol>  <li>    <p>Does intervention X (e.g. criminal justice, education) look like this? How do interventions in criminal justice compare to health? I don’t know enough to make super strong claims about what the distributions look like, but I do feel confident that most interventions have about 0 impact, and that there are at least a couple orders of magnitude difference between high-impact and low-impact interventions in a given field.</p>  </li>  <li>    <p>How much error is there when we estimate the impact of a new intervention we don’t know about? A lot, and it’s important to experiment with new things that could be in the top category. I think the EA community does a good job of funding experimental projects. But it’s also important not to waste our time with things that look a lot like things with little to no impact, which unfortunately I think is &gt;50% (and probably &gt;90%) of U.S. nonprofit funding.</p>  </li>  <li>    <p>Am I advocating we only work on a few top interventions? No. It’s important to spread out our resources somewhat, and oftentimes people will have developed specialized skills or other personal fit that make them better at working on specific things. But I think it’s still pretty clear that we can divert a lot of the 50-90+% of funding that we’re wasting onto things that we think might actually help pepole. On the margin, I want to move people towards more impactful work– I’m not arguing for some globally optimum algorithm for telling everyone exactly the 3 projects they should work on.</p>  </li>  <li>    <p>If you’ve gotten this far, <a href=\"https://80000hours.org/2020/08/misconceptions-effective-altruism/#top\">common misconceptions about effective altruism</a> may also be of interest.</p>  </li></ol><p>I think a lot of highly capable people think they’re spending enough time figuring out the highest impact interventions when they’re not. The difference between being “one of the better interventions” and “being in the top few percent of interventions” seems likely to be &gt;10x.</p>",
            "url": "http://localhost:4000/2020/10/11/pretty-good-is-not-good-enough",
            
            
            
            
            
            "date_published": "2020-10-11T00:00:00-07:00",
            "date_modified": "2020-10-11T00:00:00-07:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/10/10/deep-work-vs-entertainment",
            "title": "Deep Work Vs Entertainment",
            "summary": null,
            "content_text": "  Info gain (new ideas * value/hour) on y axis, easiness (number hours without needing a break, a proxy for effort needed) on x axis.  Shapes aren’t correct (e.g. covariance).  I’ve frequently made efforts to cut news and sports highlights out of my life as they’ve felt low value per time. I had never quantified it before though — it was useful to think about how much better a good book or conversation was. This also helped me realize that sometimes I’m trying to use a poor substitue for news/sports scores — oftentimes I want a very low-effort, small commitment break, and something like a book is too long a commitment. See addicting things for what I think are better substitutes.  It feels like almost everyone, even people who feel similarly to me, and definitely including me, spend too much time in the entertainment bucket relative to its value. Part of this is that those things have been optimized for being addicting (see above link for more).  I was also surprised by how much more valuable I thought high quality deep work was vs. reading a good book / having a great conversation. This made me think that I should try harder to protect deep work time, and read at night when I have less willpower but don’t need as much.  “Effort” isn’t one thing / should be broken into many things.  Interesting how much worse I feel at 4h of sleep vs. 6h. I perceive myself to be ~2x worse at info gain and to need ~2x more effort.",
            "content_html": "<p><img src=\"https://github.com/BillZito/billzito.github.io/blob/master/assets/IMG_4847.jpg?raw=true\" alt=\"value\" /></p><ul>  <li>Info gain (new ideas * value/hour) on y axis, easiness (number hours without needing a break, a proxy for effort needed) on x axis.</li>  <li>Shapes aren’t correct (e.g. covariance).</li>  <li>I’ve frequently made efforts to cut news and sports highlights out of my life as they’ve felt low value per time. I had never quantified it before though — it was useful to think about how much better a good book or conversation was. This also helped me realize that sometimes I’m trying to use a poor substitue for news/sports scores — oftentimes I want a very low-effort, small commitment break, and something like a book is too long a commitment. See <a href=\"https://www.billzito.com/2020/10/10/addicting-things\">addicting things</a> for what I think are better substitutes.</li>  <li>It feels like almost everyone, even people who feel similarly to me, and definitely including me, spend too much time in the entertainment bucket relative to its value. Part of this is that those things have been optimized for being addicting (see above link for more).</li>  <li>I was also surprised by how much more valuable I thought high quality deep work was vs. reading a good book / having a great conversation. This made me think that I should try harder to protect deep work time, and read at night when I have less willpower but don’t need as much.</li></ul><p><img src=\"https://github.com/BillZito/billzito.github.io/blob/master/assets/IMG_4848.jpg?raw=true\" alt=\"multipliers\" /></p><ul>  <li>“Effort” isn’t one thing / should be broken into many things.</li>  <li>Interesting how much worse I feel at 4h of sleep vs. 6h. I perceive myself to be ~2x worse at info gain and to need ~2x more effort.</li></ul>",
            "url": "http://localhost:4000/2020/10/10/deep-work-vs-entertainment",
            
            
            
            
            
            "date_published": "2020-10-10T00:00:00-07:00",
            "date_modified": "2020-10-10T00:00:00-07:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/10/10/addicting-things",
            "title": "Addicting Things",
            "summary": null,
            "content_text": "  I think people vary a good amount for all these things.  I didn’t have a great measure for addictingness. Another option I thought about was (# of times I would do the thing vs. # I wanted to do).  A lot of the badness for me of addicting things is that they make me feel like I’m not in control of my actions. I hate feeling like I can’t choose to eat less if I don’t want to.  I think facebook/twitter are slightly more addicting and slightly worse than news/sports scores.  I’ve never done cocaine, but my average estimate for it was -2 on the life satisfaction score, while my average for dessert was about -0.5. So for me, dessert addiction feels roughly 0.1x - 0.5x as bad. I like my new framing of “deca-cocaines” for me to quantify just how addicting these things are (e.g. 0.1x-0.5x is 1-5 deca-cocaines).  My dad used to work for a candy company, and they’d optimize their recipe by bringing in people, giving them free giant bowls of candy, and seeing which recipes led to people eating the most. I think people underestimate how aggressively companies have optimized on making things as addicting as possible (food, facebook, etc.).Substitutes for news/sports scores:  Eat, drink.  Walk, juggle a soccer ball.  Text a friend.  Journal, doodle.  Read better blog posts.  Watch educational youtube.  Play with an educational app like universe in a nutshell.  [Not good] book/podcast (too long a commitment / effortful).  For me, if I have a policy of only doing something rarely (never - once/month), I basically never think about doing it. But as soon as I get up to once/week, and especially at once/day or above, the number of times I think about it starts increasingly rapidly.  I’ve experimented the most with this with dessert. At once/day - 3 times/day, it won’t feel bad for days - months, but then one day I’ll be stressed or tired and binge and feel bad about myself. I did a couple years where I only ate dessert roughly once/year, and have been doing roughly once/month for the last year, and found that I don’t binge at all like that. People ask me “how do you have so much willpower to eat dessert so rarely!?” I say: what!? If I had willpower I’d eat it 3 times a day — it’s specifically because of my lack of willpower that the policy “roughly once a month” works wonders for me.  I know of a handful of other people that have experiemnted with similar things and found the “rarely” option liberating, but again I expect there to be large individual variation.  I think the body positivity movement does at least one very good thing and one questionable thing. The very good thing is that for people who feel bad about food, it helps them feel less bad about it. The questionable thing is that I feel pretty confident that for me, the “leave dessert in your house and don’t feel bad eating it every day!” thing would be counterproductive because it would lead to me thinking about dessert and binging on it much more frequently. And again, I expect this to differ by person, and am not judging you if you feel differently. As a wise person once said “some people want to eat more, some people want to eat less, and lots of people want to think about eating less.”",
            "content_html": "<p><img src=\"https://github.com/BillZito/billzito.github.io/blob/master/assets/IMG_4866.JPG?raw=true\" alt=\"addictingness\" /></p><ul>  <li>I think people vary a good amount for all these things.</li>  <li>I didn’t have a great measure for addictingness. Another option I thought about was (# of times I would do the thing vs. # I wanted to do).</li>  <li>A lot of the badness for me of addicting things is that they make me feel like I’m not in control of my actions. I hate feeling like I can’t choose to eat less if I don’t want to.</li>  <li>I think facebook/twitter are slightly more addicting and slightly worse than news/sports scores.</li>  <li>I’ve never done cocaine, but my average estimate for it was -2 on the life satisfaction score, while my average for dessert was about -0.5. So for me, dessert addiction feels roughly 0.1x - 0.5x as bad. I like my new framing of “deca-cocaines” for me to quantify just how addicting these things are (e.g. 0.1x-0.5x is 1-5 deca-cocaines).</li>  <li>My dad used to work for a candy company, and they’d optimize their recipe by bringing in people, giving them free giant bowls of candy, and seeing which recipes led to people eating the most. I think people underestimate how aggressively companies have optimized on making things as addicting as possible (food, facebook, etc.).</li></ul><h2 id=\"substitutes-for-newssports-scores\">Substitutes for news/sports scores:</h2><ul>  <li>Eat, drink.</li>  <li>Walk, juggle a soccer ball.</li>  <li>Text a friend.</li>  <li>Journal, doodle.</li>  <li>Read better blog posts.</li>  <li>Watch educational youtube.</li>  <li>Play with an educational app like <a href=\"https://shop-us.kurzgesagt.org/products/universe-in-a-nutshell-app\">universe in a nutshell</a>.</li>  <li>[Not good] book/podcast (too long a commitment / effortful).</li></ul><p><img src=\"https://github.com/BillZito/billzito.github.io/blob/master/assets/IMG_4869.JPG?raw=true\" alt=\"habits\" /></p><ul>  <li>For me, if I have a policy of only doing something rarely (never - once/month), I basically never think about doing it. But as soon as I get up to once/week, and especially at once/day or above, the number of times I think about it starts increasingly rapidly.</li>  <li>I’ve experimented the most with this with dessert. At once/day - 3 times/day, it won’t feel bad for days - months, but then one day I’ll be stressed or tired and binge and feel bad about myself. I did a couple years where I only ate dessert roughly once/year, and have been doing roughly once/month for the last year, and found that I don’t binge at all like that. People ask me “how do you have so much willpower to eat dessert so rarely!?” I say: what!? If I had willpower I’d eat it 3 times a day — it’s specifically because of my lack of willpower that the policy “roughly once a month” works wonders for me.</li>  <li>I know of a handful of other people that have experiemnted with similar things and found the “rarely” option liberating, but again I expect there to be large individual variation.</li>  <li>I think the body positivity movement does at least one very good thing and one questionable thing. The very good thing is that for people who feel bad about food, it helps them feel less bad about it. The questionable thing is that I feel pretty confident that for me, the “leave dessert in your house and don’t feel bad eating it every day!” thing would be counterproductive because it would lead to me thinking about dessert and binging on it much more frequently. And again, I expect this to differ by person, and am not judging you if you feel differently. As a wise person once said “some people want to eat more, some people want to eat less, and lots of people want to think about eating less.”</li></ul>",
            "url": "http://localhost:4000/2020/10/10/addicting-things",
            
            
            
            
            
            "date_published": "2020-10-10T00:00:00-07:00",
            "date_modified": "2020-10-10T00:00:00-07:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/10/09/can-your-cousin-be-your-grandparent",
            "title": "Can Your Cousin Be Your Grandparent",
            "summary": null,
            "content_text": "  You’re G, D is your cousin on your dad’s side and grandpa on mom’s side. A is dad, sibs with B. B and C have D together, making D your cousin. D has F with E, who in turn has a child with A, making you.  In every state, it’s legal to marry your second-cousin, who shares ~1/32nd of your genes (and in &gt;10 states, it’s legal to marry your first cousin). Assuming it’s the gene percent that matters, I think it should be legal in every state for A and F to marry if we added two more generations between D and F (I’m not showing my work, sry). It becomes harder for the age gap to work out, but is still possible. D would be your great great grandparent and cousin.",
            "content_html": "<p><img src=\"https://github.com/BillZito/billzito.github.io/blob/master/assets/IMG_4832.JPG?raw=true\" alt=\"graph\" /></p><ul>  <li>You’re G, D is your cousin on your dad’s side and grandpa on mom’s side. A is dad, sibs with B. B and C have D together, making D your cousin. D has F with E, who in turn has a child with A, making you.</li>  <li>In every state, it’s legal to marry your second-cousin, who shares ~1/32nd of your genes (and in &gt;10 states, it’s <a href=\"https://www.thespruce.com/cousin-marriage-laws-listed-by-state-2300731\">legal to marry your first cousin</a>). Assuming it’s the gene percent that matters, I think it should be legal in every state for A and F to marry if we added two more generations between D and F (I’m not showing my work, sry). It becomes harder for the age gap to work out, but is still possible. D would be your great great grandparent and cousin.</li></ul>",
            "url": "http://localhost:4000/2020/10/09/can-your-cousin-be-your-grandparent",
            
            
            
            
            
            "date_published": "2020-10-09T00:00:00-07:00",
            "date_modified": "2020-10-09T00:00:00-07:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        }
    
    ]
}