{
    "version": "https://jsonfeed.org/version/1",
    "title": "Bill Zito",
    "home_page_url": "http://localhost:4000/",
    "feed_url": "http://localhost:4000/feed.json",
    "description": null,
    "icon": "http://localhost:4000/apple-touch-icon.png",
    "favicon": "http://localhost:4000/favicon.ico",
    "expired": false,
    
    "author": "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}",
    
"items": [
    
        {
            "id": "http://localhost:4000/2020/10/10/deep-work-vs-entertainment",
            "title": "Deep Work Vs Entertainment",
            "summary": null,
            "content_text": "  Info gain (new ideas * value/hour) on y axis, easiness (number hours without needing a break, a proxy for effort needed) on x axis.  Shapes aren’t correct (e.g. covariance).  I’ve frequently made efforts to cut news and sports highlights out of my life as they’ve felt low value per time. I had never quantified it before though — it was useful to think about how much better a good book or conversation was. This also helped me realize that sometimes I’m trying to use a poor substitue for news/sports scores — oftentimes I want a very low-effort, small commitment break, and something like a book is too long a commitment. See addicting things for what I think are better substitutes.  It feels like almost everyone, even people who feel similarly to me, and definitely including me, spend too much time in the entertainment bucket relative to its value. Part of this is that those things have been optimized for being addicting (see above link for more).  I was also surprised by how much more valuable I thought high quality deep work was vs. reading a good book / having a great conversation. This made me think that I should try harder to protect deep work time, and read at night when I have less willpower but don’t need as much.  “Effort” isn’t one thing / should be broken into many things.  Interesting how much worse I feel at 4h of sleep vs. 6h. I perceive myself to be ~2x worse at info gain and to need ~2x more effort.",
            "content_html": "<p><img src=\"https://github.com/BillZito/billzito.github.io/blob/master/assets/IMG_4847.jpg?raw=true\" alt=\"value\" /></p><ul>  <li>Info gain (new ideas * value/hour) on y axis, easiness (number hours without needing a break, a proxy for effort needed) on x axis.</li>  <li>Shapes aren’t correct (e.g. covariance).</li>  <li>I’ve frequently made efforts to cut news and sports highlights out of my life as they’ve felt low value per time. I had never quantified it before though — it was useful to think about how much better a good book or conversation was. This also helped me realize that sometimes I’m trying to use a poor substitue for news/sports scores — oftentimes I want a very low-effort, small commitment break, and something like a book is too long a commitment. See <a href=\"https://www.billzito.com/2020/10/10/addicting-things\">addicting things</a> for what I think are better substitutes.</li>  <li>It feels like almost everyone, even people who feel similarly to me, and definitely including me, spend too much time in the entertainment bucket relative to its value. Part of this is that those things have been optimized for being addicting (see above link for more).</li>  <li>I was also surprised by how much more valuable I thought high quality deep work was vs. reading a good book / having a great conversation. This made me think that I should try harder to protect deep work time, and read at night when I have less willpower but don’t need as much.</li></ul><p><img src=\"https://github.com/BillZito/billzito.github.io/blob/master/assets/IMG_4848.jpg?raw=true\" alt=\"multipliers\" /></p><ul>  <li>“Effort” isn’t one thing / should be broken into many things.</li>  <li>Interesting how much worse I feel at 4h of sleep vs. 6h. I perceive myself to be ~2x worse at info gain and to need ~2x more effort.</li></ul>",
            "url": "http://localhost:4000/2020/10/10/deep-work-vs-entertainment",
            
            
            
            
            
            "date_published": "2020-10-10T00:00:00-07:00",
            "date_modified": "2020-10-10T00:00:00-07:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/10/10/addicting-things",
            "title": "Addicting Things",
            "summary": null,
            "content_text": "  I think people vary a good amount for all these things.  I didn’t have a great measure for addictingness. Another option I thought about was (# of times I would do the thing vs. # I wanted to do).  A lot of the badness for me of addicting things is that they make me feel like I’m not in control of my actions. I hate feeling like I can’t choose to eat less if I don’t want to.  I think facebook/twitter are slightly more addicting and slightly worse than news/sports scores.  I’ve never done cocaine, but my average estimate for it was -2 on the life satisfaction score, while my average for dessert was about -0.5. So for me, dessert addiction feels roughly 0.1x - 0.5x as bad. I like my new framing of “deca-cocaines” for me to quantify just how addicting these things are (e.g. 0.1x-0.5x is 1-5 deca-cocaines).  My dad used to work for a candy company, and they’d optimize their recipe by bringing in people, giving them free giant bowls of candy, and seeing which recipes led to people eating the most. I think people underestimate how aggressively companies have optimized on making things as addicting as possible (food, facebook, etc.).Substitutes for news/sports scores:  eat, drink  walk, juggle a soccer ball  text a friend  read better blog posts  [not good] book/podcast (too long a commitment / effortful)  For me, if I have a policy of only doing something rarely (never - once/month), I basically never think about doing it. But as soon as I get up to once/week, and especially at once/day or above, the number of times I think about it starts increasingly rapidly.  I’ve experimented the most with this with dessert. At once/day - 3 times/day, it won’t feel bad for days - months, but then one day I’ll be stressed or tired and binge and feel bad about myself. I did a couple years where I only ate dessert roughly once/year, and have been doing roughly once/month for the last year, and found that I don’t binge at all like that. People ask me “how do you have so much willpower to eat dessert so rarely!?” I say: what!? If I had willpower I’d eat it 3 times a day — it’s specifically because of my lack of willpower that the policy “roughly once a month” works wonders for me.  I know of a handful of other people that have experiemnted with similar things and found the “rarely” option liberating, but again I expect there to be large individual variation.  I think the body positivity movement does at least one very good thing and one questionable thing. The very good thing is that for people who feel bad about food, it helps them feel less bad about it. The questionable thing is that I feel pretty confident that for me, the “leave dessert in your house and don’t feel bad eating it every day!” thing would be counterproductive because it would lead to me thnking about dessert and binging on it much more frequently. And again, I expect this to differ by person, and am not judging you if you feel differently. Some people want to eat more, some people want to eat less, and lots of people want to find ways to think about eating less.",
            "content_html": "<p><img src=\"https://github.com/BillZito/billzito.github.io/blob/master/assets/IMG_4866.JPG?raw=true\" alt=\"addictingness\" /></p><ul>  <li>I think people vary a good amount for all these things.</li>  <li>I didn’t have a great measure for addictingness. Another option I thought about was (# of times I would do the thing vs. # I wanted to do).</li>  <li>A lot of the badness for me of addicting things is that they make me feel like I’m not in control of my actions. I hate feeling like I can’t choose to eat less if I don’t want to.</li>  <li>I think facebook/twitter are slightly more addicting and slightly worse than news/sports scores.</li>  <li>I’ve never done cocaine, but my average estimate for it was -2 on the life satisfaction score, while my average for dessert was about -0.5. So for me, dessert addiction feels roughly 0.1x - 0.5x as bad. I like my new framing of “deca-cocaines” for me to quantify just how addicting these things are (e.g. 0.1x-0.5x is 1-5 deca-cocaines).</li>  <li>My dad used to work for a candy company, and they’d optimize their recipe by bringing in people, giving them free giant bowls of candy, and seeing which recipes led to people eating the most. I think people underestimate how aggressively companies have optimized on making things as addicting as possible (food, facebook, etc.).</li></ul><h2 id=\"substitutes-for-newssports-scores\">Substitutes for news/sports scores:</h2><ul>  <li>eat, drink</li>  <li>walk, juggle a soccer ball</li>  <li>text a friend</li>  <li>read better blog posts</li>  <li>[not good] book/podcast (too long a commitment / effortful)</li></ul><p><img src=\"https://github.com/BillZito/billzito.github.io/blob/master/assets/IMG_4869.JPG?raw=true\" alt=\"habits\" /></p><ul>  <li>For me, if I have a policy of only doing something rarely (never - once/month), I basically never think about doing it. But as soon as I get up to once/week, and especially at once/day or above, the number of times I think about it starts increasingly rapidly.</li>  <li>I’ve experimented the most with this with dessert. At once/day - 3 times/day, it won’t feel bad for days - months, but then one day I’ll be stressed or tired and binge and feel bad about myself. I did a couple years where I only ate dessert roughly once/year, and have been doing roughly once/month for the last year, and found that I don’t binge at all like that. People ask me “how do you have so much willpower to eat dessert so rarely!?” I say: what!? If I had willpower I’d eat it 3 times a day — it’s specifically because of my lack of willpower that the policy “roughly once a month” works wonders for me.</li>  <li>I know of a handful of other people that have experiemnted with similar things and found the “rarely” option liberating, but again I expect there to be large individual variation.</li>  <li>I think the body positivity movement does at least one very good thing and one questionable thing. The very good thing is that for people who feel bad about food, it helps them feel less bad about it. The questionable thing is that I feel pretty confident that for me, the “leave dessert in your house and don’t feel bad eating it every day!” thing would be counterproductive because it would lead to me thnking about dessert and binging on it much more frequently. And again, I expect this to differ by person, and am not judging you if you feel differently. Some people want to eat more, some people want to eat less, and lots of people want to find ways to think about eating less.</li></ul>",
            "url": "http://localhost:4000/2020/10/10/addicting-things",
            
            
            
            
            
            "date_published": "2020-10-10T00:00:00-07:00",
            "date_modified": "2020-10-10T00:00:00-07:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/10/09/can-your-cousin-be-your-grandparent",
            "title": "Can Your Cousin Be Your Grandparent",
            "summary": null,
            "content_text": "  You’re G, D is your cousin on your dad’s side and grandpa on mom’s side. A is dad, sibs with B. B and C have D together, making D your cousin. D has F with E, who in turn has a child with A, making you.  In every state, it’s legal to marry your second-cousin, who shares ~1/32nd of your genes (and in &gt;10 states, it’s legal to marry your first cousin). Assuming it’s the gene percent that matters, I think it should be legal in every state for A and F to marry if we added two more generations between D and F (I’m not showing my work, sry). It becomes harder for the age gap to work out, but is still possible. D would be your great great grandparent and cousin.",
            "content_html": "<p><img src=\"https://github.com/BillZito/billzito.github.io/blob/master/assets/IMG_4832.JPG?raw=true\" alt=\"graph\" /></p><ul>  <li>You’re G, D is your cousin on your dad’s side and grandpa on mom’s side. A is dad, sibs with B. B and C have D together, making D your cousin. D has F with E, who in turn has a child with A, making you.</li>  <li>In every state, it’s legal to marry your second-cousin, who shares ~1/32nd of your genes (and in &gt;10 states, it’s <a href=\"https://www.thespruce.com/cousin-marriage-laws-listed-by-state-2300731\">legal to marry your first cousin</a>). Assuming it’s the gene percent that matters, I think it should be legal in every state for A and F to marry if we added two more generations between D and F (I’m not showing my work, sry). It becomes harder for the age gap to work out, but is still possible. D would be your great great grandparent and cousin.</li></ul>",
            "url": "http://localhost:4000/2020/10/09/can-your-cousin-be-your-grandparent",
            
            
            
            
            
            "date_published": "2020-10-09T00:00:00-07:00",
            "date_modified": "2020-10-09T00:00:00-07:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        }
    
    ]
}