{
    "version": "https://jsonfeed.org/version/1",
    "title": "Bill Zito",
    "home_page_url": "http://localhost:4000/",
    "feed_url": "http://localhost:4000/feed.json",
    "description": null,
    "icon": "http://localhost:4000/apple-touch-icon.png",
    "favicon": "http://localhost:4000/favicon.ico",
    "expired": false,
    
    "author": "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}",
    
"items": [
    
        {
            "id": "http://localhost:4000/2021/03/14/just-a-bitting",
            "title": "Just A Bitting",
            "summary": null,
            "content_text": "When I start doing something, knowing that once I start, it’ll be hard to stop, I call that “just-a-bitting” myself. I, like everyone, do this to myself surprisingly frequently without noticing it. Common examples of just-a-bitting that people express some misgivings about are watching Netflix, reading Hackernews / your favorite way to browse the internet, playing video games, and eating cookies. But you can also just-a-bit yourself with lots of other things. Once I get in a good writing flow, I don’t want to stop. It’s the same for programming and for soccer.As those last examples suggest, it can actually be a very positive thing to just-a-bit myself. One of the best ways to get into a new hobby or career interest is to fall in love with the thing you’re learning to do. You can think of the task as: how do I design an activity, such that when I start, I am intrinsically motivated to keep going. Repeatedly just-a-bitting yourself is a core component of this.There’s also an important corollary to the positive reinforcement of repeated actions. If you can cut a thing out of your life completely, your brain will often stop desiring the thing soon after stopping (like, within a few days for many things in my experience).Up until age 13, I used to play something like an hour of video games a day. But then one day I decided it wasn’t worth that much time, and cut it out completely. What surprised me is that after a few days of not playing, I also didn’t desire to play. There appears to be an important shift between “thinking about whether I want something every day” vs. “I never do this” – if I don’t need to consider the decision, I don’t think about it at all.There are many biological needs that one cannot cut out. Humans need enough of many types of nutrients, and people feel hungry if they don’t eat enough of those. Friendship, exercise, and sex are also core needs. But for many of the things we do habitually, the desire to do them diminishes greatly by not doing it all.Two of the most common things to just-a-bit oneself about are disputes and money, and as PG says, it’s easy to let these things become the “top idea” in one’s mind – the thing we keep thinking about constantly throughout the day.In addition to trying not to get into fights in the first place, another tricky part about disputes is that there’s often a component from one party of “I don’t want to talk about this right now.” If the dispute matters a lot to at least one person, it can then be very hard to stop thinking about the dispute until it is resolved.I don’t know of a one-size-fits-all solution for this unfortunately. One thing that seems to help me is to have a set time when I will talk about the thing next, so that I can comfort myself in knowing “we will resolve this tomorrow” instead of feeling a need to figure out how to solve the thing. Another thing I tried recently was trying to notice every time I was thinking about the dispute, and to just write down on paper how I was feeling as soon as I noticed, without judgement for getting caught up in it. This was helpful for preventing just-a-bitting, as I had a simple action for what I should do when it comes up.Interestingly, I also noticed that I wasn’t actually angry almost all of the times I started thinking about the dispute – I only got angry when I let myself keep thinking about all of the details of the disagreement. This helped me feel like the dispute actually wasn’t a big deal, and that I didn’t have to keep thinking about it as often.Every once in a while, I try to just write down all the things that I’m doing regularly. Oftentimes I find that I’m just-a-bitting myself on something that I don’t actually want to be doing. And sometimes, just by not doing the thing for a few days or changing my mindset about starting the thing in the first place, I can greatly reduce the desire to do the thing.",
            "content_html": "<p>When I start doing something, knowing that once I start, it’ll be hard to stop, I call that “just-a-bitting” myself. I, like everyone, do this to myself surprisingly frequently without noticing it. Common examples of just-a-bitting that people express some misgivings about are watching Netflix, reading Hackernews / your favorite way to browse the internet, playing video games, and eating cookies. But you can also just-a-bit yourself with lots of other things. Once I get in a good writing flow, I don’t want to stop. It’s the same for programming and for soccer.</p><p>As those last examples suggest, it can actually be a very positive thing to just-a-bit myself. One of the best ways to get into a new hobby or career interest is to <a href=\"https://dcgross.com/falling-in-love/\">fall</a> in <a href=\"http://www.paulgraham.com/love.html\">love</a> with the thing you’re learning to do. You can think of the task as: how do I design an activity, such that when I start, I am intrinsically motivated to keep going. Repeatedly just-a-bitting yourself is a core component of this.</p><p>There’s also an important corollary to the positive reinforcement of repeated actions. If you can cut a thing out of your life completely, your brain will often stop desiring the thing soon after stopping (like, within a few days for many things in my experience).</p><p>Up until age 13, I used to play something like an hour of video games a day. But then one day I decided it wasn’t worth that much time, and cut it out completely. What surprised me is that after a few days of not playing, I also didn’t desire to play. There appears to be an important shift between “thinking about whether I want something every day” vs. “I never do this” – if I don’t need to consider the decision, I don’t think about it at all.</p><p>There are many biological needs that one cannot cut out. Humans need enough of many types of nutrients, and people feel hungry if they don’t eat enough of those. Friendship, exercise, and sex are also core needs. But for many of the things we do habitually, the desire to do them diminishes greatly by not doing it all.</p><p>Two of the most common things to just-a-bit oneself about are <a href=\"http://www.paulgraham.com/top.html\">disputes and money</a>, and as PG says, it’s easy to let these things become the “top idea” in one’s mind – the thing we keep thinking about constantly throughout the day.</p><p>In addition to trying not to get into fights in the first place, another tricky part about disputes is that there’s often a component from one party of “I don’t want to talk about this right now.” If the dispute matters a lot to at least one person, it can then be very hard to stop thinking about the dispute until it is resolved.</p><p>I don’t know of a one-size-fits-all solution for this unfortunately. One thing that seems to help me is to have a set time when I will talk about the thing next, so that I can comfort myself in knowing “we will resolve this tomorrow” instead of feeling a need to figure out how to solve the thing. Another thing I tried recently was trying to notice every time I was thinking about the dispute, and to just write down on paper how I was feeling as soon as I noticed, without judgement for getting caught up in it. This was helpful for preventing just-a-bitting, as I had a simple action for what I should do when it comes up.</p><p>Interestingly, I also noticed that I wasn’t actually angry almost all of the times I started thinking about the dispute – I only got angry when I let myself keep thinking about all of the details of the disagreement. This helped me feel like the dispute actually wasn’t a big deal, and that I didn’t have to keep thinking about it as often.</p><p>Every once in a while, I try to just write down all the things that I’m doing regularly. Oftentimes I find that I’m just-a-bitting myself on something that I don’t actually want to be doing. And sometimes, just by not doing the thing for a few days or changing my mindset about starting the thing in the first place, I can greatly reduce the desire to do the thing.</p>",
            "url": "http://localhost:4000/2021/03/14/just-a-bitting",
            
            
            
            
            
            "date_published": "2021-03-14T00:00:00-08:00",
            "date_modified": "2021-03-14T00:00:00-08:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/12/31/reflection-prompts",
            "title": "Reflection Prompts",
            "summary": null,
            "content_text": "Some reflection prompts I’ve used in the past.Weekly  30m - 1h, bullet point list of 2-3 things that went well and 3 - 10 things I want to improve for the next week, priority ranked (P0, P1, P2)  Imagine I am the CEO of whatever it is I’m working on – what are the biggest problems?  Look over any weekly goals or daily tracking and think about what to improve (work, sleep, nutrition, exercise).  Imagine myself 30 years from now, and I’ve done all the big things I want to do in life. What advice would that person give me?  Murphyjitsu for the most important things I want to improve for next week.Every 1 - 3 months  Do some thinking about if I’m headed in the right direction in life generally.  Am I very excited about what I’m doing and the 5 people I’m spending most of my time with? If it’s not a “hell yes,” it’s a no (see “Biggest learnings” for what I mean).  The 30 years from now prompt.  Read one to a few blogs from role models (either their advice to others or stories about them) – think about what advice they would give you.  How can I make this next month the most productive of my life?  Write out my ideal schedule for the next week (which people that I’m spending time with, how much I’m working on x and y). Then write out what I’m actually doing. How can I cut out the things I don’t want to be doing and add the things I do want to be doing?  What are my most important cruxes for my current life choices vs. other things I could be doing?  How can I do 10x as much as I’ve done previously?  How can I accomplish what I want to in 10 years in 1 year?  Who are the people in the world that seem to have the most important things figured out? How can I spend more time with them?  Hamming circle prompts are pretty good.Some learnings from doing weekly / daily reflections  Re: “am I very excited” – my general heuristic is that if it’s not a “hell yes” it’s a no (it’s easy for me to get complacent with my current situation and forget what it was like when I was really excited about what I was doing). I believe I have a pretty significant bias towards staying where I am, because I have basically always regretted staying in situations longer than I should have vs. have never regretted leaving something too early yet.  There’s never a good time to give someone bad news (e.g. it’s tempting to put off quitting a job or breaking up with someone, but it’s easy to put that off for months when it’s probably not good to).  It’s very common for me to think my ideas for what to do in life from 1 - 3 years ago are really dumb in hindsight, so I should have humility that my current plan has some key flaws.  Focus is super important, and I feel much more productive when I decide to do one thing all out vs. trying to do two things at once (e.g. a job and learning something else).",
            "content_html": "<p>Some reflection prompts I’ve used in the past.</p><h2 id=\"weekly\">Weekly</h2><ul>  <li>30m - 1h, bullet point list of 2-3 things that went well and 3 - 10 things I want to improve for the next week, priority ranked (P0, P1, P2)</li>  <li>Imagine I am the CEO of whatever it is I’m working on – what are the biggest problems?</li>  <li>Look over any weekly goals or daily tracking and think about what to improve (work, sleep, nutrition, exercise).</li>  <li>Imagine myself 30 years from now, and I’ve done all the big things I want to do in life. What advice would that person give me?</li>  <li>Murphyjitsu for the most important things I want to improve for next week.</li></ul><h2 id=\"every-1---3-months\">Every 1 - 3 months</h2><ul>  <li>Do some thinking about if I’m headed in the right direction in life generally.</li>  <li>Am I very excited about what I’m doing and the 5 people I’m spending most of my time with? If it’s not a “hell yes,” it’s a no (see “Biggest learnings” for what I mean).</li>  <li>The 30 years from now prompt.</li>  <li>Read one to a few blogs from role models (either their advice to others or stories about them) – think about what advice they would give you.</li>  <li>How can I make this next month the most productive of my life?</li>  <li>Write out my ideal schedule for the next week (which people that I’m spending time with, how much I’m working on x and y). Then write out what I’m actually doing. How can I cut out the things I don’t want to be doing and add the things I do want to be doing?</li>  <li>What are my most important cruxes for my current life choices vs. other things I could be doing?</li>  <li>How can I do 10x as much as I’ve done previously?</li>  <li>How can I accomplish what I want to in 10 years in 1 year?</li>  <li>Who are the people in the world that seem to have the most important things figured out? How can I spend more time with them?</li>  <li>Hamming circle prompts are pretty good.</li></ul><h2 id=\"some-learnings-from-doing-weekly--daily-reflections\">Some learnings from doing weekly / daily reflections</h2><ul>  <li>Re: “am I very excited” – my general heuristic is that if it’s not a “hell yes” it’s a no (it’s easy for me to get complacent with my current situation and forget what it was like when I was really excited about what I was doing). I believe I have a pretty significant bias towards staying where I am, because I have basically always regretted staying in situations longer than I should have vs. have never regretted leaving something too early yet.</li>  <li>There’s never a good time to give someone bad news (e.g. it’s tempting to put off quitting a job or breaking up with someone, but it’s easy to put that off for months when it’s probably not good to).</li>  <li>It’s very common for me to think my ideas for what to do in life from 1 - 3 years ago are really dumb in hindsight, so I should have humility that my current plan has some key flaws.</li>  <li>Focus is super important, and I feel much more productive when I decide to do one thing all out vs. trying to do two things at once (e.g. a job and learning something else).</li></ul>",
            "url": "http://localhost:4000/2020/12/31/reflection-prompts",
            
            
            
            
            
            "date_published": "2020-12-31T00:00:00-08:00",
            "date_modified": "2020-12-31T00:00:00-08:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/11/29/short-form-enchiridion",
            "title": "Short Form: Enchiridion",
            "summary": null,
            "content_text": "The Enchiridion by Epictetus, 135AC lays out some useful frames on how to live, especially for managing one’s emotions. Epictetus was a philosopher of stoicism (I knew nothing about stoicism before reading The Enchiridion). If you read numbers 1 - 10 (of 50), that’s maybe 60% of the value for 20m of effort. H/t to A for the recommendation. As always, other’s hot-takes appreciated.My takeaways:  One main idea is to only care about things in your control (your actions and feelings about events) instead of things out of your control (other’s actions, reputation, circumstances of your e.g. body and family). While this seems obvious as stated, the details of actually taking this serious are useful. Reputation is one interesting example. It feels like something we can control (by being awesome), but by focusing only on the actions (the being awesome) and not other’s beliefs, it can free us from unproductive worrying. Similarly, envy towards others is less productive than thinking about actions one wants to take. There’s an underlying theme in much of the work of trying to not care at all about other’s beliefs, which although hard to do in practice, seems useful to consider doing more of.  I also liked thinking about what it’d be like to not care about other’s decisions. I have some strong beliefs about how people should pursue their lives, and I sometimes let myself worry about if my friends and loved ones are making all the decisions that I want them to. While it seems good to try to convince friends of things sometimes, I think it’s healthy to stay focused on “shooting one’s best shot” in trying to convince them, and then not worrying as much about the result. As with most “sales,” the first rule of sales is that deals fall through, and you have to learn to not get upset about that.  I liked the analogy of living life as if you were at a dinner party, esepcially the bit about not stretching for things that have not come yet. I have lots of goals in life, and so it’s easy for me to spend a bunch of cycles worrying about accomplishing those goals. I think it’s healthier to internalize realisitic time frames of when things will get done by, and to not spend too much time yearning for things that realistically can’t be accomplished very quickly.  Another useful thing that I’m going to try: thinking about what you want out of an environment to focus on keeping those things even if you get disrupted. E.g. when I go to sit at my desk to work, I want to be in a state of flow/ focused work, and sometimes when I’m tired or get interrupted, I end up being distracted for a long time. Focusing on the goal of the environment seems plausibly useful to do more of the good.More rapid fire:  Stay focused on the ship even during side quests, else you’ll get swept up in them. Useful to keep as many cycles on the most important things as possible.  “I have returned it” is a powerful frame on loss – the mistake people make is that they take the people and things they have in their life for granted, whereas “I have returned it” makes the fleeting nature more clear. This made me think about my grandma’s memoir, which says a lot of similar things that were really useful for me in thinking about “loss.” In particular, I like framing the overwhelming emotion of loss as “thank you for those great experiences” than “sad that I don’t get them anymore.”  Be wary of “If I neglect my affairs, I will have no income” —&gt; better to give it up and not be concerned. It’s easy to let us make excuses about the things we “have to do,” but it can be liberating to not force ourselves to do those things, and to take bigger risks for bigger rewards.  “You have your role, act it.” I believe in my own potential to do things, but I also have to be honest with myself about what I’m good at so that I can best accomplish my goals.  “Don’t hand mind to others.” Esepcially when I’m angry, I “hand my mind to others” in that I let myself get carried away in thinking about them. I like that frame for trying not to spend as much time worrying about disputes.Overall: I definitely recommend reading, and it’s a quick read (although sometimes hard to parse). I think there is a lot of good “mental jijitsu” in how to reframe problems to not let them take up unproductive cycles.",
            "content_html": "<p><a href=\"http://classics.mit.edu/Epictetus/epicench.html\">The Enchiridion by Epictetus</a>, 135AC lays out some useful frames on how to live, especially for managing one’s emotions. Epictetus was a philosopher of <a href=\"https://en.wikipedia.org/wiki/Stoicism\">stoicism</a> (I knew nothing about stoicism before reading The Enchiridion). If you read numbers 1 - 10 (of 50), that’s maybe 60% of the value for 20m of effort. H/t to A for the recommendation. As always, other’s hot-takes appreciated.</p><p>My takeaways:</p><ul>  <li>One main idea is to only care about things in your control (your actions and feelings about events) instead of things out of your control (other’s actions, reputation, circumstances of your e.g. body and family). While this seems obvious as stated, the details of actually taking this serious are useful. Reputation is one interesting example. It feels like something we can control (by being awesome), but by focusing only on the actions (the being awesome) and not other’s beliefs, it can free us from unproductive worrying. Similarly, envy towards others is less productive than thinking about actions one wants to take. There’s an underlying theme in much of the work of trying to not care at all about other’s beliefs, which although hard to do in practice, seems useful to consider doing more of.</li>  <li>I also liked thinking about what it’d be like to not care about other’s decisions. I have some strong beliefs about how people should pursue their lives, and I sometimes let myself worry about if my friends and loved ones are making all the decisions that I want them to. While it seems good to try to convince friends of things sometimes, I think it’s healthy to stay focused on “shooting one’s best shot” in trying to convince them, and then not worrying as much about the result. As with most “sales,” the first rule of sales is that deals fall through, and you have to learn to not get upset about that.</li>  <li>I liked the analogy of living life as if you were at a dinner party, esepcially the bit about not stretching for things that have not come yet. I have lots of goals in life, and so it’s easy for me to spend a bunch of cycles worrying about accomplishing those goals. I think it’s healthier to internalize realisitic time frames of when things will get done by, and to not spend too much time yearning for things that realistically can’t be accomplished very quickly.</li>  <li>Another useful thing that I’m going to try: thinking about what you want out of an environment to focus on keeping those things even if you get disrupted. E.g. when I go to sit at my desk to work, I want to be in a state of flow/ focused work, and sometimes when I’m tired or get interrupted, I end up being distracted for a long time. Focusing on the goal of the environment seems plausibly useful to do more of the good.</li></ul><p>More rapid fire:</p><ul>  <li>Stay focused on the ship even during side quests, else you’ll get swept up in them. Useful to keep as many cycles on the most important things as possible.</li>  <li>“I have returned it” is a powerful frame on loss – the mistake people make is that they take the people and things they have in their life for granted, whereas “I have returned it” makes the fleeting nature more clear. This made me think about my grandma’s memoir, which says a lot of similar things that were really useful for me in thinking about “loss.” In particular, I like framing the overwhelming emotion of loss as “thank you for those great experiences” than “sad that I don’t get them anymore.”</li>  <li>Be wary of “If I neglect my affairs, I will have no income” —&gt; better to give it up and not be concerned. It’s easy to let us make excuses about the things we “have to do,” but it can be liberating to not force ourselves to do those things, and to take bigger risks for bigger rewards.</li>  <li>“You have your role, act it.” I believe in my own potential to do things, but I also have to be honest with myself about what I’m good at so that I can best accomplish my goals.</li>  <li>“Don’t hand mind to others.” Esepcially when I’m angry, I “hand my mind to others” in that I let myself get carried away in thinking about them. I like that frame for trying not to spend as much time worrying about disputes.</li></ul><p>Overall: I definitely recommend reading, and it’s a quick read (although sometimes hard to parse). I think there is a lot of good “mental jijitsu” in how to reframe problems to not let them take up unproductive cycles.</p>",
            "url": "http://localhost:4000/2020/11/29/short-form-enchiridion",
            
            
            
            
            
            "date_published": "2020-11-29T00:00:00-08:00",
            "date_modified": "2020-11-29T00:00:00-08:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/11/28/short-form-educated",
            "title": "Short Form: Educated",
            "summary": null,
            "content_text": "Spoiler alert: going to talk about details of the bookEducated is a really good book. Tara (the author) manages to tell the story as she experienced it without passing judgement on her family for things they did wrong, giving us a clearer view of the struggle to figure out what is “true” when living for decades in others’ distorted (and sometimes abusive) realities. I’m interested in other’s hot-takes, and if you haven’t read it yet, take this as a pitch!My takeaways:  Especially when so many things that matter (family, livelihood, safety) are tied to our beliefs about the world, it can be very, very hard to figure out what is true. There is part of her (and part of me) that wants to believe fake realities we’ve been told, and it took many years for both of us to step further away from those.  Guilt is a very powerful weapon for abusers – abusers decrease others’ self-worth and use that to get what they want. Abusers are kind sometimes, and rationalize their abuse to make it reality, leaving the abused with an alternative reality. Abusers often have some sociopathic qualities. And then they use the fact that the abused are not sociopathic to mainpulate them into thinking they are in the wrong.  One of the hardest things in figuring out how to deal with abusive people is that they seem to believe what they are saying, and can convincingly explain their side of the story without the years of first-hand experience to understand their patterns. It seems likely that many abusive people actually do believe their distorted stories – that lying to oneself and then being “honest” to others is common, maybe because humans have norms that it’s not ok to purposefully deceive people but that it is ok to be “mistaken” about what actually happened.  When you have to be self-reliant to survive, have tried to trust your loved ones and they’ve repeatedly failed you, it’s hard to ask for help. “I can fix this” is dangerous – sometimes we need to ask for help. Also, sometimes it’s better to decide not to abandon the problem altogether. This helped me realize ways in which I was being unnecessarily self-reliant.  So much of beliefs are based on what we’ve seen happen in similiar situations – it takes conscious effort to think about what one should say instead of the brain’s auto-fill function. It’s wild how many people never escape from the “reality” they are born into, and further wild that even those who do learn to believe other things still have trouble breaking free of cached beliefs and habits.  The book helped me develop more empathy for Trump supporters and other people that seem to live in different realities than I do. When everyone around you believes a version of events that is very believable without a bunch of effort to learn other things, and when there are strong incentives to believe what others believe to fit in, have a family, job, etc., it’s very hard to break free.",
            "content_html": "<p><strong>Spoiler alert: going to talk about details of the book</strong></p><p><a href=\"https://www.amazon.com/Educated-Memoir-Tara-Westover/dp/0399590501\">Educated</a> is a really good book. Tara (the author) manages to tell the story as she experienced it without passing judgement on her family for things they did wrong, giving us a clearer view of the struggle to figure out what is “true” when living for decades in others’ distorted (and sometimes abusive) realities. I’m interested in other’s hot-takes, and if you haven’t read it yet, take this as a pitch!</p><p>My takeaways:</p><ul>  <li>Especially when so many things that matter (family, livelihood, safety) are tied to our beliefs about the world, it can be very, very hard to figure out what is true. There is part of her (and part of me) that wants to believe fake realities we’ve been told, and it took many years for both of us to step further away from those.</li>  <li>Guilt is a very powerful weapon for abusers – abusers decrease others’ self-worth and use that to get what they want. Abusers are kind sometimes, and rationalize their abuse to make it reality, leaving the abused with an alternative reality. Abusers often have some sociopathic qualities. And then they use the fact that the abused are not sociopathic to mainpulate them into thinking they are in the wrong.</li>  <li>One of the hardest things in figuring out how to deal with abusive people is that they seem to believe what they are saying, and can convincingly explain their side of the story without the years of first-hand experience to understand their patterns. It seems likely that many abusive people actually do believe their distorted stories – that lying to oneself and then being “honest” to others is common, maybe because humans have norms that it’s not ok to purposefully deceive people but that it is ok to be “mistaken” about what actually happened.</li>  <li>When you have to be self-reliant to survive, have tried to trust your loved ones and they’ve repeatedly failed you, it’s hard to ask for help. “I can fix this” is dangerous – sometimes we need to ask for help. Also, sometimes it’s better to decide not to abandon the problem altogether. This helped me realize ways in which I was being unnecessarily self-reliant.</li>  <li>So much of beliefs are based on what we’ve seen happen in similiar situations – it takes conscious effort to think about what one should say instead of the brain’s auto-fill function. It’s wild how many people never escape from the “reality” they are born into, and further wild that even those who do learn to believe other things still have trouble breaking free of cached beliefs and habits.</li>  <li>The book helped me develop more empathy for Trump supporters and other people that seem to live in different realities than I do. When everyone around you believes a version of events that is very believable without a bunch of effort to learn other things, and when there are strong incentives to believe what others believe to fit in, have a family, job, etc., it’s very hard to break free.</li></ul>",
            "url": "http://localhost:4000/2020/11/28/short-form-educated",
            
            
            
            
            
            "date_published": "2020-11-28T00:00:00-08:00",
            "date_modified": "2020-11-28T00:00:00-08:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/10/10/short-form-deep-work-vs-entertainment",
            "title": "Short Form: Deep Work Vs Entertainment",
            "summary": null,
            "content_text": "  Info gain (new ideas * value/hour) on y axis, easiness (number hours without needing a break, a proxy for effort needed) on x axis.  Shapes aren’t correct (e.g. covariance).  I’ve frequently made efforts to cut news and sports highlights out of my life as they’ve felt low value per time. I had never quantified it before though — it was useful to think about how much better a good book or conversation was. This also helped me realize that sometimes I’m trying to use a poor substitue for news/sports scores — oftentimes I want a very low-effort, small commitment break, and something like a book is too long a commitment. See addicting things for what I think are better substitutes.  It feels like almost everyone, even people who feel similarly to me, and definitely including me, spend too much time in the entertainment bucket relative to its value. Part of this is that those things have been optimized for being addicting (see above link for more).  I was also surprised by how much more valuable I thought high quality deep work was vs. reading a good book / having a great conversation. This made me think that I should try harder to protect deep work time, and read at night when I have less willpower but don’t need as much.  “Effort” isn’t one thing / should be broken into many things.  Interesting how much worse I feel at 4h of sleep vs. 6h. I perceive myself to be ~2x worse at info gain and to need ~2x more effort.",
            "content_html": "<p><img src=\"https://github.com/BillZito/billzito.github.io/blob/master/assets/IMG_4847.jpg?raw=true\" alt=\"value\" /></p><ul>  <li>Info gain (new ideas * value/hour) on y axis, easiness (number hours without needing a break, a proxy for effort needed) on x axis.</li>  <li>Shapes aren’t correct (e.g. covariance).</li>  <li>I’ve frequently made efforts to cut news and sports highlights out of my life as they’ve felt low value per time. I had never quantified it before though — it was useful to think about how much better a good book or conversation was. This also helped me realize that sometimes I’m trying to use a poor substitue for news/sports scores — oftentimes I want a very low-effort, small commitment break, and something like a book is too long a commitment. See <a href=\"https://www.billzito.com/2020/10/10/addicting-things\">addicting things</a> for what I think are better substitutes.</li>  <li>It feels like almost everyone, even people who feel similarly to me, and definitely including me, spend too much time in the entertainment bucket relative to its value. Part of this is that those things have been optimized for being addicting (see above link for more).</li>  <li>I was also surprised by how much more valuable I thought high quality deep work was vs. reading a good book / having a great conversation. This made me think that I should try harder to protect deep work time, and read at night when I have less willpower but don’t need as much.</li></ul><p><img src=\"https://github.com/BillZito/billzito.github.io/blob/master/assets/IMG_4848.jpg?raw=true\" alt=\"multipliers\" /></p><ul>  <li>“Effort” isn’t one thing / should be broken into many things.</li>  <li>Interesting how much worse I feel at 4h of sleep vs. 6h. I perceive myself to be ~2x worse at info gain and to need ~2x more effort.</li></ul>",
            "url": "http://localhost:4000/2020/10/10/short-form-deep-work-vs-entertainment",
            
            
            
            
            
            "date_published": "2020-10-10T00:00:00-07:00",
            "date_modified": "2020-10-10T00:00:00-07:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/10/10/short-form-addicting-things",
            "title": "Short Form: Addicting Things",
            "summary": null,
            "content_text": "  I think people vary a good amount for all these things.  I didn’t have a great measure for addictingness. Another option I thought about was (# of times I would do the thing vs. # I wanted to do).  A lot of the badness for me of addicting things is that they make me feel like I’m not in control of my actions. I hate feeling like I can’t choose to eat less if I don’t want to.  I think facebook/twitter are slightly more addicting and slightly worse than news/sports scores.  I’ve never done cocaine, but my average estimate for it was -2 on the life satisfaction score, while my average for dessert was about -0.5. So for me, dessert addiction feels roughly 0.1x - 0.5x as bad. I like my new framing of “deca-cocaines” for me to quantify just how addicting these things are (e.g. 0.1x-0.5x is 1-5 deca-cocaines).  My dad used to work for a candy company, and they’d optimize their recipe by bringing in people, giving them free giant bowls of candy, and seeing which recipes led to people eating the most. I think people underestimate how aggressively companies have optimized on making things as addicting as possible (food, facebook, etc.).Substitutes for news/sports scores:  Eat, drink.  Walk, juggle a soccer ball.  Text a friend.  Journal, doodle.  Read better blog posts.  Watch educational youtube.  Play with an educational app like universe in a nutshell.  [Not good] book/podcast (too long a commitment / effortful).  For me, if I have a policy of only doing something rarely (never - once/month), I basically never think about doing it. But as soon as I get up to once/week, and especially at once/day or above, the number of times I think about it starts increasingly rapidly.  I’ve experimented the most with this with dessert. At once/day - 3 times/day, it won’t feel bad for days - months, but then one day I’ll be stressed or tired and binge and feel bad about myself. I did a couple years where I only ate dessert roughly once/year, and have been doing roughly once/month for the last year, and found that I don’t binge at all like that. People ask me “how do you have so much willpower to eat dessert so rarely!?” I say: what!? If I had willpower I’d eat it 3 times a day — it’s specifically because of my lack of willpower that the policy “roughly once a month” works wonders for me.  I know of a handful of other people that have experiemnted with similar things and found the “rarely” option liberating, but again I expect there to be large individual variation.  I think the body positivity movement does at least one very good thing and one questionable thing. The very good thing is that for people who feel bad about food, it helps them feel less bad about it. The questionable thing is that I feel pretty confident that for me, the “leave dessert in your house and don’t feel bad eating it every day!” thing would be counterproductive because it would lead to me thinking about dessert and binging on it much more frequently. And again, I expect this to differ by person, and am not judging you if you feel differently. As a wise person once said “some people want to eat more, some people want to eat less, and lots of people want to think about eating less.”",
            "content_html": "<p><img src=\"https://github.com/BillZito/billzito.github.io/blob/master/assets/IMG_4866.JPG?raw=true\" alt=\"addictingness\" /></p><ul>  <li>I think people vary a good amount for all these things.</li>  <li>I didn’t have a great measure for addictingness. Another option I thought about was (# of times I would do the thing vs. # I wanted to do).</li>  <li>A lot of the badness for me of addicting things is that they make me feel like I’m not in control of my actions. I hate feeling like I can’t choose to eat less if I don’t want to.</li>  <li>I think facebook/twitter are slightly more addicting and slightly worse than news/sports scores.</li>  <li>I’ve never done cocaine, but my average estimate for it was -2 on the life satisfaction score, while my average for dessert was about -0.5. So for me, dessert addiction feels roughly 0.1x - 0.5x as bad. I like my new framing of “deca-cocaines” for me to quantify just how addicting these things are (e.g. 0.1x-0.5x is 1-5 deca-cocaines).</li>  <li>My dad used to work for a candy company, and they’d optimize their recipe by bringing in people, giving them free giant bowls of candy, and seeing which recipes led to people eating the most. I think people underestimate how aggressively companies have optimized on making things as addicting as possible (food, facebook, etc.).</li></ul><h2 id=\"substitutes-for-newssports-scores\">Substitutes for news/sports scores:</h2><ul>  <li>Eat, drink.</li>  <li>Walk, juggle a soccer ball.</li>  <li>Text a friend.</li>  <li>Journal, doodle.</li>  <li>Read better blog posts.</li>  <li>Watch educational youtube.</li>  <li>Play with an educational app like <a href=\"https://shop-us.kurzgesagt.org/products/universe-in-a-nutshell-app\">universe in a nutshell</a>.</li>  <li>[Not good] book/podcast (too long a commitment / effortful).</li></ul><p><img src=\"https://github.com/BillZito/billzito.github.io/blob/master/assets/IMG_4869.JPG?raw=true\" alt=\"habits\" /></p><ul>  <li>For me, if I have a policy of only doing something rarely (never - once/month), I basically never think about doing it. But as soon as I get up to once/week, and especially at once/day or above, the number of times I think about it starts increasingly rapidly.</li>  <li>I’ve experimented the most with this with dessert. At once/day - 3 times/day, it won’t feel bad for days - months, but then one day I’ll be stressed or tired and binge and feel bad about myself. I did a couple years where I only ate dessert roughly once/year, and have been doing roughly once/month for the last year, and found that I don’t binge at all like that. People ask me “how do you have so much willpower to eat dessert so rarely!?” I say: what!? If I had willpower I’d eat it 3 times a day — it’s specifically because of my lack of willpower that the policy “roughly once a month” works wonders for me.</li>  <li>I know of a handful of other people that have experiemnted with similar things and found the “rarely” option liberating, but again I expect there to be large individual variation.</li>  <li>I think the body positivity movement does at least one very good thing and one questionable thing. The very good thing is that for people who feel bad about food, it helps them feel less bad about it. The questionable thing is that I feel pretty confident that for me, the “leave dessert in your house and don’t feel bad eating it every day!” thing would be counterproductive because it would lead to me thinking about dessert and binging on it much more frequently. And again, I expect this to differ by person, and am not judging you if you feel differently. As a wise person once said “some people want to eat more, some people want to eat less, and lots of people want to think about eating less.”</li></ul>",
            "url": "http://localhost:4000/2020/10/10/short-form-addicting-things",
            
            
            
            
            
            "date_published": "2020-10-10T00:00:00-07:00",
            "date_modified": "2020-10-10T00:00:00-07:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/07/06/valuing-relationships-over-decisions",
            "title": "Valuing Relationships Over Decisions",
            "summary": null,
            "content_text": "Let’s say your team is debating Plan A and Plan B, and Plan A is not only clearly wrong to you, but it’s indicative of some of your coworker’s weaknesses. You feel pretty strongly about Plan B, and it’s important to your team’s success, so you push hard for Plan B. Somehow, despite Plan A’s clear weaknesses, your coworker doubles down on Plan A, and the disagreement is seeming to stretch out longer and longer and get more and more personal.It’s easy to get too focused on making the right object-level decision and miss the more important thing: relationships with your coworkers are more important than decisions. A company is a long-term investment in each other. You are trusting each other to come to the generally-right solution quickly, and to develop the skills as individuals and as a group to do that. When a disagreement drags on too long, you’re implicitly saying that the individual decision is more important than the investment in your coworker.1This isn’t to say you should always go with your coworker’s plans. Sometimes, you’re upset about Plan A specifically because you’ve compromised to go with things like Plan A in the past and regretted it. When the team doesn’t have a shared understanding about the costs and benefits of plans, it’s often because they have poor processes for goal-setting and evaluation, or because the argument is abstract enough that it’s hard to get evidence on who is right. Without a shared understanding of what the goals should be, what worked well, and what didn’t, it’s easy for different parties to see different costs and benefits. Even if you can’t agree on the choice between Plan A and Plan B, oftentimes you can agree on the metrics for success of the plans so that you can iterate quickly if the plan is not going well.Romantic relationships are hard, but coworker relationships may be even harder. Just like romantic relationships, coworker relationships need a highly positive ratio of positive:negative interactions (a little birdy said it didn’t replicate, but someone once said 5:1 positive:negative was a good ratio for romantic relationships). People often don’t invest enough in positive interactions with their coworkers, maybe because coworkers spend so much time together already or because romantic relationships usually have more in-depth feedback. As a rough heuristic for this, you can think about the hypothetical of dating your coworker, and you’ll get a pretty quick visceral sense of if you have a deep shared positive trust in each other.Individual decisions usually don’t kill teams, but losing a key member is more likely to. Teams change, processes break, and broken processes lead to relationship stress. Take a step back, invest in relationships, fix the processes, and iterate quickly.[1] Sometimes you’ve lost trust in a coworker to the point that you don’t think you’ll ever be able to regain it. This is a pretty strong sign that things aren’t working out.",
            "content_html": "<p>Let’s say your team is debating Plan A and Plan B, and Plan A is not only clearly wrong to you, but it’s indicative of some of your coworker’s weaknesses. You feel pretty strongly about Plan B, and it’s important to your team’s success, so you push hard for Plan B. Somehow, despite Plan A’s clear weaknesses, your coworker doubles down on Plan A, and the disagreement is seeming to stretch out longer and longer and get more and more personal.</p><p>It’s easy to get too focused on making the right object-level decision and miss the more important thing: relationships with your coworkers are more important than decisions. A company is a long-term investment in each other. You are trusting each other to come to the generally-right solution quickly, and to develop the skills as individuals and as a group to do that. When a disagreement drags on too long, you’re implicitly saying that the individual decision is more important than the investment in your coworker.<sup>1</sup></p><p>This isn’t to say you should always go with your coworker’s plans. Sometimes, you’re upset about Plan A specifically because you’ve compromised to go with things like Plan A in the past and regretted it. When the team doesn’t have a shared understanding about the costs and benefits of plans, it’s often because they have poor processes for goal-setting and evaluation, or because the argument is abstract enough that it’s hard to get evidence on who is right. Without a shared understanding of what the goals should be, what worked well, and what didn’t, it’s easy for different parties to see different costs and benefits. Even if you can’t agree on the choice between Plan A and Plan B, oftentimes you can agree on the metrics for success of the plans so that you can iterate quickly if the plan is not going well.</p><p>Romantic relationships are hard, but coworker relationships may be even harder. Just like romantic relationships, coworker relationships need a highly positive ratio of positive:negative interactions (a little birdy said it didn’t replicate, but someone once said 5:1 positive:negative was a good ratio for romantic relationships). People often don’t invest enough in positive interactions with their coworkers, maybe because coworkers spend so much time together already or because romantic relationships usually have more in-depth feedback. As a rough heuristic for this, you can think about the hypothetical of dating your coworker, and you’ll get a pretty quick visceral sense of if you have a deep shared positive trust in each other.</p><p>Individual decisions usually don’t kill teams, but losing a key member is more likely to. Teams change, processes break, and broken processes lead to relationship stress. Take a step back, invest in relationships, fix the processes, and iterate quickly.</p><p>[1] Sometimes you’ve lost trust in a coworker to the point that you don’t think you’ll ever be able to regain it. This is a pretty strong sign that things aren’t working out.</p>",
            "url": "http://localhost:4000/2020/07/06/valuing-relationships-over-decisions",
            
            
            
            
            
            "date_published": "2020-07-06T00:00:00-07:00",
            "date_modified": "2020-07-06T00:00:00-07:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2019/11/30/advice-i-d-give-15-year-old-me",
            "title": "Advice I'd Give 15 Year Old Me",
            "summary": null,
            "content_text": "Two things I’d try to convince 15 year old me about are exploring better and doing harder things.Exploring betterBy 15, I knew that I wanted my work to be focused on helping people. I’ve tried various strategies over the last decade for doing that, and at each point in time felt that my strategy from the previous couple of years was pretty dumb. For example, I spent several years doing standard non-profit-type things like running tutoring programs, and now think that almost always, those are not effective at improving student’s lives. Additionally, I’ve thought the periods focused on exploration were some of the most valuable (my first couple months at college, the couple months I drove across the country interviewing nonprofit founders, the first couple months in the effective altruism community). Together, those two things suggest to me that I needed a much larger meta-update that I should spend more time exploring and thinking hard about different ways to have an impact.Another aspect of this is that 15 year old me (and 20 year old me to a lesser extent), had more trust in the standard ways of doing things. I thought that standard nonprofit approaches were more impactful than I do now, that schools were better at helping people learn useful things, and that governments and organizations were better at addressing large problems than they are. While it takes time to figure these things out, it would have been useful to pay more attention to the evidence against these things earlier.So, do I explore enough and think hard enough about how to have an impact now? I think I’ve definitely gotten better at it, but I’m pretty confident that within the next 2-5 years I’ll have some big updates about good ways to have an impact. I think the effective altruism community overall, and especially specific thoughtful people within it, are much, much better than the rest of the world at thinking hard about the right things to work on. So I’m hopeful that being a part of the community will help me continue to question my assumptions. I also try to read more now and to spend more time thinking about the core assumptions that my work rests on.I think that most people that want to make an impact could benefit significantly from spending a bunch more time exploring and thinking about the best ways to have an impact. Since most people don’t do that, it leads to complacency. We (myself definitely included) think we’re being objective and thoughtful in the moment, but really things like “I feel more thoughtful than the other people in my community” make us feel thoughtful, and we don’t spend enough time thinking about “is everyone in my community confused about how to have an impact?”Doing harder thingsDoing hard things is a great way to learn things, as by definition, you view them as hard and therefore at the edge of your ability to execute on them. There’s also this interesting thing where as people develop more skills and have more successes, they gain more confidence in their ability to do even harder things.I think people also systematically underestimate what they’re capable of doing. For example, my dad convinced me to tryout for soccer teams where I would be the worst one on the team. I definitely wouldn’t have tried out if he hadn’t pushed me to do this and convinced me to keep going at the times when I wanted to quit. I got cut from several of these teams over the course of several years. But on the two year timescale, I also got a lot better at soccer, to the point where I was better than the average person on those teams. I’ve had similar experiences where I’ve felt over my head in other domains, e.g. starting things or leading teams of engineers, but I had the ability to take these harder steps even though they seemed very hard to me as I took them.I think teams / organizations are a key ingredient for getting people to take these “harder than they think they can” steps, and maybe especially so for me, as I really hate letting people down. Another important part about doing hard things is that it helps connect you with other people that want to do hard things, which helps both on the motivation and doing-the-right-thing axes.It also seems like people’s willingness and ability to do hard things continues to increase over time for most people, such that I expect 35 year old me to have enough skills, and perhaps more importantly enough confidence, to do things that I wouldn’t consider doing now.So not only would I tell 15 year old me to try harder things, I would also tell 15 year old me to take even larger steps on the hardness scale (e.g. after succeeding at starting a tutoring organization, trying something that is several times harder than that instead of something that is just a little harder).I think that most people that want to have a positive impact would also benefit from trying harder things. As hard things go, people could fail, but I think that it’s useful for people to develop models for what types of hard things to try and for how to more quickly test their assumptions so they don’t spend a long time failing.Given that I believe that most people are not pointed in the right direction, I’m not sure if it’s good advice to tell most people to try harder things, but I think it’s good advice for people that seem headed in the mostly-right-direction. Because I think I was pointed in not-quite-right directions, I think most of the hard things I’ve done in the past haven’t done much good for the world, but I am glad that I did them for the personal learnings.",
            "content_html": "<p>Two things I’d try to convince 15 year old me about are exploring better and doing harder things.</p><h2 id=\"exploring-better\">Exploring better</h2><p>By 15, I knew that I wanted my work to be focused on helping people. I’ve tried various strategies over the last decade for doing that, and at each point in time felt that my strategy from the previous couple of years was pretty dumb. For example, I spent several years doing standard non-profit-type things like running tutoring programs, and now think that almost always, those are not effective at improving student’s lives. Additionally, I’ve thought the periods focused on exploration were some of the most valuable (my first couple months at college, the couple months I drove across the country interviewing nonprofit founders, the first couple months in the effective altruism community). Together, those two things suggest to me that I needed a much larger meta-update that I should spend more time exploring and thinking hard about different ways to have an impact.</p><p>Another aspect of this is that 15 year old me (and 20 year old me to a lesser extent), had more trust in the standard ways of doing things. I thought that standard nonprofit approaches were more impactful than I do now, that schools were better at helping people learn useful things, and that governments and organizations were better at addressing large problems than they are. While it takes time to figure these things out, it would have been useful to pay more attention to the evidence against these things earlier.</p><p>So, do I explore enough and think hard enough about how to have an impact now? I think I’ve definitely gotten better at it, but I’m pretty confident that within the next 2-5 years I’ll have some big updates about good ways to have an impact. I think the effective altruism community overall, and especially specific thoughtful people within it, are much, much better than the rest of the world at thinking hard about the right things to work on. So I’m hopeful that being a part of the community will help me continue to question my assumptions. I also try to read more now and to spend more time thinking about the core assumptions that my work rests on.</p><p>I think that most people that want to make an impact could benefit significantly from spending a bunch more time exploring and thinking about the best ways to have an impact. Since most people don’t do that, it leads to complacency. We (myself definitely included) think we’re being objective and thoughtful in the moment, but really things like “I feel more thoughtful than the other people in my community” make us feel thoughtful, and we don’t spend enough time thinking about “is everyone in my community confused about how to have an impact?”</p><h2 id=\"doing-harder-things\">Doing harder things</h2><p>Doing hard things is a great way to learn things, as by definition, you view them as hard and therefore at the edge of your ability to execute on them. There’s also this interesting thing where as people develop more skills and have more successes, they gain more confidence in their ability to do even harder things.</p><p>I think people also systematically underestimate what they’re capable of doing. For example, my dad convinced me to tryout for soccer teams where I would be the worst one on the team. I definitely wouldn’t have tried out if he hadn’t pushed me to do this and convinced me to keep going at the times when I wanted to quit. I got cut from several of these teams over the course of several years. But on the two year timescale, I also got a lot better at soccer, to the point where I was better than the average person on those teams. I’ve had similar experiences where I’ve felt over my head in other domains, e.g. starting things or leading teams of engineers, but I had the ability to take these harder steps even though they seemed very hard to me as I took them.</p><p>I think teams / organizations are a key ingredient for getting people to take these “harder than they think they can” steps, and maybe especially so for me, as I really hate letting people down. Another important part about doing hard things is that it helps connect you with other people that want to do hard things, which helps both on the motivation and doing-the-right-thing axes.</p><p>It also seems like people’s willingness and ability to do hard things continues to increase over time for most people, such that I expect 35 year old me to have enough skills, and perhaps more importantly enough confidence, to do things that I wouldn’t consider doing now.</p><p>So not only would I tell 15 year old me to try harder things, I would also tell 15 year old me to take even larger steps on the hardness scale (e.g. after succeeding at starting a tutoring organization, trying something that is several times harder than that instead of something that is just a little harder).</p><p>I think that most people that want to have a positive impact would also benefit from trying harder things. As hard things go, people could fail, but I think that it’s useful for people to develop models for what types of hard things to try and for how to more quickly test their assumptions so they don’t spend a long time failing.</p><p>Given that I believe that most people are not pointed in the right direction, I’m not sure if it’s good advice to tell most people to try harder things, but I think it’s good advice for people that seem headed in the mostly-right-direction. Because I think I was pointed in not-quite-right directions, I think most of the hard things I’ve done in the past haven’t done much good for the world, but I am glad that I did them for the personal learnings.</p>",
            "url": "http://localhost:4000/2019/11/30/advice-i-d-give-15-year-old-me",
            
            
            
            
            
            "date_published": "2019-11-30T00:00:00-08:00",
            "date_modified": "2019-11-30T00:00:00-08:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        }
    
    ]
}